local L = AceLibrary("AceLocale-2.2"):new("Altoholic")
local BI = LibStub("LibBabble-Inventory-3.0"):GetLookupTable()
local BZ = LibStub("LibBabble-Zone-3.0"):GetLookupTable()
local BF = LibStub("LibBabble-Faction-3.0"):GetLookupTable()
local WHITE		= "|cFFFFFFFF"
local GREEN		= "|cFF00FF00"
local YELLOW	= "|cFFFFFF00"

if GetLocale() ~= "zhTW" then return end

-- 以下為聲望值、等級、技能等的建議
Altoholic.Suggestions = {
	[L["Riding"]] = {
		{ 75, "初級騎術(40級): |cFFFFFFFF90g\n|cFFFFD700主城附近的的普通坐騎:|cFFFFFFFF10g" },
		{ 150, "中級騎術(60級): |cFFFFFFFF600g\n|cFFFFD700主城附近的史詩級坐騎:|cFFFFFFFF100g" }
	},
	
	-- 來源 : http://forums.worldofwarcraft.com/thread.html?topicId=102789457&sid=1（英文）
	-- ** 主專業技能 **
	[BI["Tailoring"]] = {
		{ 50, "1-50: 亞麻布卷\n(2x亞麻布)x80" },
		{ 70, "51-70: 亞麻包\n(3x亞麻布卷/3x粗線)x20" },
		{ 75, "71-75: 強化亞麻斗篷\n(2x亞麻布卷/3x粗線)x5" },
		{ 105, "76-105: 毛布卷\n(3x毛料)x60" },
		{ 110, "106-110: 灰色毛紡襯衣\n(2x毛布卷/1x細線/1x灰色染料)x5"},
		{ 125, "111-125: 雙線毛紡護肩\n(3x毛布卷/2x細線)x15" },
		{ 145, "126-145: 絲綢卷\n(4x絲綢)x190" },
		{ 160, "146-160: 碧藍絲質頭巾\n(2x絲綢卷/2x藍色染料/1x細線)x15" },
		{ 170, "161-170: 絲質頭帶\n(3x絲綢卷/2x細線)x10" },
		{ 175, "171-175: 體面的白襯衣\n(3x絲綢卷/2x漂白液/1x細線)x5" },
		{ 185, "176-185: 魔紋布卷\n(5x魔紋布)x100" },
		{ 205, "186-205: 深紅絲質外衣\n(4x絲綢卷/2x紅色染料/2x細線)x15" },
		{ 215, "206-215: 深紅絲質馬褲\n(4x絲綢卷/2x紅色染料/2x絲線)x15" },
		{ 220, "216-220: 黑色魔紋短褲\n黑色魔紋外衣\n(2x魔紋布卷/3x絲線)x5" },
		{ 230, "221-230: 黑色魔紋手套\n(2x魔紋布卷/2x粗絲線)x10" },
		{ 250, "231-250: 黑色魔紋頭帶\n黑色魔紋護肩\n(3x魔紋布卷/2x粗絲線)x20" },
		{ 260, "251-260: 符文布卷\n(5x符文布)x180" },
		{ 275, "261-275: 符文布腰帶\n(3x符文布卷/1x符文線)x15" },
		{ 280, "276-280: 符文布背包\n(5x符文布卷/2x硬甲皮/1x符文線)x5" },
		{ 300, "281-300: 符文布手套\n(4x符文布卷/4x硬甲皮/1x符文線)x20" }
	},
	[BI["Leatherworking"]] = {
		{ 35, "1-35: 輕型護甲片\n(1x輕皮)x35" },
		{ 55, "36-55: 熟化輕毛皮\n(1x輕毛皮/1x鹽)x20" },
		{ 80, "56-80: 雕花皮靴\n(8x輕皮/5x粗線)x15" },
		{ 85, "81-85: 優質皮帶\n(6x輕皮/2x粗線)x5" },
		{ 90, "86-90: 優質皮外套\n(3x熟化輕毛皮/6x輕皮/4x粗線)x5" },
		{ 100, "91-100: 優質皮帶\n(6x輕皮/2x粗線)x10" },
		{ 120, "101-120: 熟化中毛皮\n(1x中毛皮/1x鹽)x20" },
		{ 125, "121-125: 優質皮帶\n(6x輕皮/2x粗線)x5" },
		{ 150, "126-150: 黑皮腰帶\n(1x優質皮帶/1x熟化中毛皮/2x細線/1x灰色染料)x25" },
		{ 160, "151-160: 熟化重毛皮\n(1x重毛皮/3x鹽)x10" },
		{ 170, "161-170: 重型護甲片\n(5x重皮/1x細線)x10" },
		{ 180, "171-180: 暗色皮護腿\n(10x重皮/1x黑色染料/2x細線)x10\n守護短褲\n(12x重皮/2x絲綢卷/2x細線)x10" },
		{ 195, "181-195: 野人護肩\n(8x重皮/1x熟化重毛皮/2x細線)x15" },
		{ 205, "196-205: 暗色護腕\n(16x重皮/1x黑色染料/2x絲線)x10" },
		{ 220, "206-220: 厚重護甲片\n(5x厚皮/1x絲線)x15" },
		{ 225, "221-225: 夜色頭帶\n(5x厚皮/2x絲線)x5" },
		{ 250, "226-250: 根據你的專精可以為:\n元素制皮:\n夜色頭帶\n(5x厚皮/2x絲線)x25\n夜色外套\n(7x厚皮/2x絲線)x25\n夜色短褲(14x厚皮/4x絲線)x20\n龍鱗制皮:\n硬化蠍殼胸甲(12x厚皮/12x蠍殼/4x絲線)x25\n硬化蠍殼手套(6x厚皮/8x蠍殼/2x絲線)x25\n部族制皮:\n龜殼頭盔(14x厚皮/24x龜殼/1x粗絲線)x20\n龜殼護腿(14x厚皮/28x龜殼/1x粗絲線)x15\n龜殼胸甲(6x厚皮/12x龜殼/1x粗絲線)x25\n龜殼手套(6x厚皮/8x龜殼/1x粗絲線)x25\n龜殼護腕(8x厚皮/12x龜殼/1x粗絲線)x25\n"},
		{ 260, "251-260: 夜色長靴\n(16x厚皮/2x粗絲線)x10" },
		{ 270, "261-270: 邪惡皮甲護手\n(8x硬甲皮/1x黑色染料/1x符文線)x10" },
		{ 285, "271-285: 邪惡皮甲護腕\n(8x硬甲皮/1x黑色染料/1x符文線)x10" },
		{ 300, "286-300: 邪惡皮甲頭環\n(12x硬甲皮/1x黑色染料/1x符文線)x15" }
	},
	[BI["Engineering"]] = {
		{ 40, "1-40: 劣質火藥\n(1x劣質的石頭)x40" },
		{ 50, "41-50: 一把螺栓\n(1x銅錠)x10" },
		{ 51, "51: 扳手\n(6x銅錠)x1" },
		{ 65, "52-65: 銅管\n(2x銅錠/1x弱效助熔劑)x14" },
		{ 75, "66-75: 劣質火槍\n(1x銅管/1x一把螺栓/1x木柴)x10" },
		{ 95, "76-95: 粗制火藥粉\n(1x粗糙的石頭)x20" },
		{ 105, "96-105: 銀觸媒\n(1x銀錠)x10" },
		{ 120, "106-120: 青銅管\n(2x青銅錠/1x弱效助熔劑)x15" },
		{ 125, "121-125: 小型青銅炸彈\n(4x粗制火藥粉/2x青銅錠/1x銀觸媒/1x毛料)x5" },
		{ 145, "126-145: 烈性火藥\n(1x沉重的石頭)x20" },
		{ 150, "146-150: 重磅青銅炸彈\n(2x烈性火藥/3x青銅錠/1x銀觸媒)x5" },
		{ 175, "151-175: 藍色焰火/紅色焰火/綠色焰火\n(1x烈性火藥/1x重皮)x25" },
		{ 176, "176: 地精微調器\n(4x鋼錠)x1" },
		{ 190, "177-190: 實心炸藥\n(2x堅固的石頭)x14" },
		{ 195, "191-195: 重磅鐵制炸彈\n(3x烈性火藥/3x鐵錠/1x銀觸媒)x5" },
		{ 205, "196-205: 秘銀管\n(3x秘銀錠)x10" },
		{ 210, "206-210: 不牢固的扳機\n(1x秘銀錠/1x魔紋布/1x實心炸藥)x5" },
		{ 225, "211-225: 高速秘銀彈頭\n(1x秘銀錠/1x實心炸藥)x15" },
		{ 235, "226-235: 秘銀外殼\n(3x秘銀錠)x10" },
		{ 245, "236-245: 高爆炸彈\n(2x秘銀外殼/1x不牢固的扳機/2x實心炸藥)x10" },
		{ 250, "246-250: 秘銀螺旋彈\n(2x秘銀錠/2x實心炸藥)x5" },
		{ 260, "251-260: 緻密炸藥粉\n(2x厚重的石頭)x10" },
		{ 290, "261-290: 瑟銀零件\n(3x瑟銀錠/1x符文布)x30" },
		{ 300, "291-300: 瑟銀管\n(3x瑟銀錠)x10\n瑟銀彈\n(2x瑟銀錠/1x緻密炸藥粉)x10" }
	},
	[BI["Enchanting"]] = {
		{ 2, "1-2: 符文銅棒\n(1x銅棒/1x奇異之塵/1x次級魔法精華)x1" },
		{ 75, "3-75: 附魔護腕 - 初級生命\n(1x奇異之塵)x73" },
		{ 85, "76-85: 附魔護腕 - 初級偏斜\n(1x次級魔法精華/1x奇異之塵)x20" },
		{ 100, "86-100: 附魔護腕 - 初級耐力\n(3x奇異之塵)x15" },
		{ 101, "101: 符文銀棒\n(1x銀棒/6x奇異之塵/3x強效魔法精華/1x符文銅棒)x1" },
		{ 105, "102-105: 附魔護腕 - 初級耐力\n(3x奇異之塵)x4" },
		{ 120, "106-120: 強效魔法杖\n(1x普通木柴/1x強效魔法精華)x15" },
		{ 130, "121-130: 附魔盾牌 - 初級耐力\n(1x次級星界精華/2x奇異之塵)x10" },
		{ 150, "131-150: 附魔護腕 - 次級耐力\n(2x靈魂之塵)x20" },
		{ 151, "151: 符文金棒\n(1x金棒/1x彩色珍珠/2x強效星界精華/2x靈魂之塵/1x符文銀棒)x1" },
		{ 160, "152-160: 附魔護腕 - 次級耐力\n(2x靈魂之塵)x9" },
		{ 165, "161-165: 附魔盾牌 - 次級耐力\n(1x次級秘法精華/1x靈魂之塵)x5" },
		{ 180, "166-180: 附魔護腕 - 精神\n(1x次級秘法精華)x15" },
		{ 200, "181-200: 附魔護腕 - 力量\n(1x幻象之塵)x20" },
		{ 201, "201: 符文真銀棒\n(1x真銀棒/1x黑珍珠/2x強效秘法精華/2x幻象之塵/1x符文金棒)x1" },
		{ 205, "202-205: 附魔護腕 - 力量\n(1x幻象之塵)x4" },
		{ 225, "206-225: 附魔披風 - 強效防禦\n(3x幻象之塵)x20" },
		{ 235, "226-235: 附魔手套 - 敏捷\n(1x次級虛空精華/1x幻象之塵)x10" },
		{ 245, "236-245: 附魔胸甲 - 超強生命\n(6x幻象之塵)x10" },
		{ 250, "246-250: 附魔護腕 - 強效力量\n(2x夢境之塵/1x強效虛空精華)x5" },
		{ 270, "251-270: 次級法力之油\n(3x夢境之塵/2x紫蓮花/1x水晶瓶)x20\n配方購於:\n卡妮亞:希利蘇斯<51,39>" },
		{ 290, "271-290: 附魔盾牌 - 強效耐力\n(10x夢境之塵)x20\n附魔靴子 - 強效耐力\n(10x夢境之塵)x20" },
		{ 291, "291: 符文奧金棒\n(1x奧金棒/1x金珍珠/10x幻影之塵/4x強效不滅精華/1x符文真銀棒/2x大塊魔光碎片)x1" },
		{ 300, "292-300: 附魔披風 - 超強防禦\n(8x幻影之塵)x9" }
	},
	[BI["Blacksmithing"]] = {	
		{ 25, "1-25: 劣質磨刀石\n(1x劣質的石頭)x25" },
		{ 45, "26-45: 劣質砂輪\n(2x劣質的石頭)x20" },
		{ 75, "46-75: 銅質鎖甲腰帶\n(6x銅錠)x30" },
		{ 80, "76-80: 粗制砂輪\n(2x粗糙的石頭)x5" },
		{ 100, "81-100: 銅質符文腰帶\n(10x銅錠)x20" },
		{ 105, "101-105: 銀棒\n(1x銀錠/2x劣質砂輪)x5" },
		{ 125, "106-125: 劣質青銅護腿\n(6x青銅錠)x20" },
		{ 150, "126-150: 重砂輪\n(3x沉重的石頭)x25" },
		{ 155, "151-155: 金棒\n(1x金錠/2x粗制砂輪)x5" },
		{ 165, "156-165: 綠鐵護腿\n(8x鐵錠/1x重砂輪/1x綠色染料)x10" },
		{ 185, "166-185: 綠鐵護腕\n(6x鐵錠/1x綠色染料)x20" },
		{ 200, "186-200: 金鱗護腕\n(5x鋼錠/2x重砂輪)x15" },
		{ 210, "201-210: 堅固的砂輪\n(4x堅固的石頭)x10" },
		{ 215, "211-215: 金鱗護腕\n(5x鋼錠/2x重砂輪)x5" },
		{ 235, "216-235: 鋼質頭盔\n(14x鋼錠/1x堅固的砂輪)x20\n秘銀鱗片護腕(成本低)\n(8x秘銀錠)x20\n配方購於:\n哈爾甘:辛特蘭,鷹巢山<13,44>\n卡爾拉什:悲傷沼澤,斯通納德<45,51>" },
		{ 250, "236-250: 秘銀罩帽\n(10x秘銀錠/6x魔紋布)x15\n秘銀馬刺(成本低)\n(4x秘銀錠/3x堅固的砂輪)x15\n配方世界掉落" },
		{ 260, "251-260: 緻密磨刀石\n(1x厚重的石頭)x10" },
		{ 270, "261-270: 瑟銀腰帶(成本低)\n(12x瑟銀錠/4x紅色能量水晶)x10\n瑟銀護腕(成本低)\n(12x瑟銀錠/4x藍色能量水晶)x10\n以上兩種配方世界掉落\n地鑄護腿 (防具鍛造)\n(16x秘銀錠/2x大地之核)x10\n風鑄護腿(防具鍛造)\n((16x秘銀錠/2x風之氣息))x10\n輕型地鑄利刃(鑄劍大師)\n(12x秘銀錠/4x大地之核)x10\n輕型灰燼鑄錘(鑄錘大師)\n(12x秘銀錠/4x火焰之心)x10\n輕型天鑄戰斧(大師鑄斧)\n(12x秘銀錠/4x風之氣息)x10" },
		{ 295, "271-295: 君王鎧甲護腕\n(12x瑟銀錠)x25\n配方任務取得" },
		{ 300, "296-300: 君王鎧甲戰靴\n(18x瑟銀錠)x5\n配方任務取得" }
	},
	[BI["Alchemy"]] = {	
		{ 60, "1-60: 初級治療藥水\n(1x寧神花/1x銀葉草/1x空瓶)x60" },
		{ 110, "61-110: 次級治療藥水\n(1x初級治療藥水/1x石南草)x50" },
		{ 140, "111-140: 治療藥水\n(1x跌打草/1x石南草/1x鉛瓶)x30" },
		{ 155, "141-155: 次級法力藥水\n(1x魔皇草/1x荊棘藻/1x空瓶)x15" },
		{ 185, "156-185: 強效治療藥水\n(1x活根草/1x皇血草/1x鉛瓶)x30" },
		{ 210, "186-210: 敏捷藥劑\n(1x荊棘藻/1x金棘草/1x鉛瓶)x25" },
		{ 215, "211-215: 強效防禦藥劑\n(1x野鋼花/1x金棘草/1x鉛瓶)x5" },
		{ 230, "216-230: 優質治療藥水\n(1x太陽草/1x卡德加的鬍鬚/1x水晶瓶)x15" },
		{ 250, "231-250: 偵測不死生物藥劑\n(1x阿爾薩斯之淚/1x水晶瓶)x20" },
		{ 265, "251-265: 強效敏捷藥劑\n(1x太陽草/1x金棘草/1x水晶瓶)x15" },
		{ 285, "266-285: 超強法力藥水\n(2x太陽草/2x盲目草/1x水晶瓶)x20" },
		{ 300, "286-300: 極效治療藥水\n(2x黃金參/1x山鼠草/1x水晶瓶)x15" }
	},
	[L["Mining"]] = {
		{ 65, "1-65: 銅礦\n所有起始地區" },
		{ 125, "66-125: 錫礦/銀礦/火岩礦/次級血石礦\n\n火岩礦分佈于瑟根石(濕地)\n很容易升到125" },
		{ 175, "126-175: 鐵礦/金礦\n淒涼之地/灰谷/荒蕪之地/阿拉希高地\n奧特蘭克山脈/荊棘谷/悲傷沼澤" },
		{ 250, "176-250: 秘銀礦/真銀礦\n詛咒之地/灼熱峽谷/荒蕪之地/辛特蘭\n西瘟疫之地/艾薩拉/冬泉谷/費伍德森林/石爪山脈/塔納利斯" },
		{ 300, "251-300: 瑟銀礦\n安戈洛環形山/冬泉谷/詛咒之地/灼熱峽谷\n燃燒平原/東瘟疫之地/西瘟疫之地" }
	},
	[L["Herbalism"]] = {
		{ 50, "1-50: 銀葉草/寧神花\n所有起始地區" },
		{ 70, "51-70: 魔皇草/地根草\n貧瘠之地/西部荒野/銀松森林/洛克莫丹/黑海岸" },
		{ 100, "71-100: 石南草\n銀松森林/暮色森林/黑海岸/洛克莫丹/赤脊山" },
		{ 115, "101-115: 跌打草\n灰谷/石爪山脈/南貧瘠之地/洛克莫丹/赤脊山" },
		{ 125, "116-125: 野鋼花\n石爪山脈/阿拉希高地/荊棘谷/南貧瘠之地/千針石林" },
		{ 160, "126-160: 皇血草\n灰谷/石爪山脈/濕地/希爾斯布萊德丘陵/悲傷沼澤" },
		{ 185, "161-185: 枯葉草\n悲傷沼澤" },
		{ 205, "186-205: 卡德加的鬍鬚\n辛特蘭/阿拉希高地/悲傷沼澤" },
		{ 230, "206-230: 火焰花\n灼熱峽谷/詛咒之地/塔納利斯" },
		{ 250, "231-250: 太陽草\n費伍德森林/菲拉斯/艾薩拉/辛特蘭" },
		{ 270, "251-270: 格羅姆之血\n費伍德森林/詛咒之地/瑪諾洛克集會所(淒涼之地)" },
		{ 285, "271-285: 夢葉草\n安戈洛環形山/艾薩拉" },
		{ 300, "286-300: 瘟疫花\n東瘟疫之地/西瘟疫之地/費伍德森林/\n冰蓋草\n冬泉谷" }
	},
	[L["Skinning"]] = {
		{ 300, "1-300: 技能等級處以5,\n所獲值對應的可剝皮怪物" }
	},
	-- 來源: http://www.almostgaming.com/wowguides/world-of-warcraft-lockpicking-guide
	[L["Lockpicking"]] = {
		{ 85, "1-85: 開鎖練習\n奧瑟爾伐木場，赤脊山(聯盟)\n棘齒城附近的海盜船(部落)" },
		{ 150, "86-150: 制毒任務目標怪附近的箱子\n西部荒野(聯盟)/貧瘠之地(部落)" },
		{ 185, "151-185: 魚人營地(濕地)" },
		{ 225, "186-225: 薩瑟裏斯海岸(淒涼之地)\n" },
		{ 250, "226-250: 苦痛堡壘(荒蕪之地)" },
		{ 275, "251-275: 熔渣之池(灼熱峽谷)" },
		{ 300, "276-300: 落帆海灣(塔納利斯)\n風暴海灣(艾薩拉)" }
	},
	
	-- ** 輔助技能 **
	[BI["First Aid"]] = {
		{ 40, "1-40: 亞麻繃帶" },
		{ 80, "41-80: 厚亞麻繃帶\n50的時候學急救(中級)" },
		{ 115, "81-115: 絨線繃帶" },
		{ 150, "116-150: 厚絨線繃帶\n125的時候去買教材<中級急救教材 - 繃帶縛體>和2個配方\n配方購於:\n德尼布沃克:阿拉希高地,激流堡<27,58>\n格魯克卡恩:塵泥沼澤,蕨牆村<35,30>\n巴萊洛克維:塵泥沼澤,蕨牆村<36,30>" },
		{ 180, "151-180: 絲質繃帶" },
		{ 210, "181-210: 厚絲質繃帶\n200的時候滿35級，做任務學會急救(專家級)\n地點:塞拉摩島(聯盟)/落錘鎮(部落)" },
		{ 240, "211-240: 魔紋繃帶\n" },
		{ 260, "241-260: 厚魔紋繃帶" },
		{ 290, "261-290: 符文布繃帶" },
		{ 300, "291-300: 厚符文布繃帶\n300的時候去買教材<大師級急救手冊 - 私人醫生>\n配方購於:\n阿蕾瑟拉:地獄火半島,塔哈瑪特神殿<26,62>\n布林庫:地獄火半島,獵鷹崗哨<22,39>" }
	},
	[BI["Cooking"]] = {
		{ 40, "1-40: 香料麵包\n(1x麵粉/1x甜香料)x70" },
		{ 75, "41-75: 熏熊肉\n(1x熊肉)x30\n配方購於:\n德拉克卷刃:洛克莫丹<35,49>\n安德魯希爾伯特:銀松森林<43,40>" },
		{ 85, "76-85: 蟹肉蛋糕(聯盟)\n(1x蟹肉, 1x甜香料)x10\n熏熊肉(部落)\n(1x熊肉)x20\n配方購於:\n德拉克卷刃:洛克莫丹<35,49>\n安德魯希爾伯特:銀松森林<43,40>" },
		{ 90, "86-90: 煮蟹爪(聯盟)\n(1x蟹爪, 1x甜香料)x5\n配方購於:\n肯多爾卡邦卡:暴風城<74,36>\n熏熊肉(部落)\n(1x熊肉)x10\n配方購於:\n德拉克卷刃:洛克莫丹<35,49>\n安德魯希爾伯特:銀松森林<43,40>" },
		{ 100, "91-100: 煮蟹爪(聯盟)\n(1x蟹爪/1x甜香料)x15\n配方購於:\n肯多爾卡邦卡:暴風城<74,36>\n掘地鼠燉肉(部落)\n(1x掘地鼠)x10\n配方任務獲取:[23]掘地鼠燉肉" },
		{ 125, "101-125: 掘地鼠燉肉(部落)\n(1x掘地鼠)x30\n配方任務獲取:[23]掘地鼠燉肉\n幹烤狼肉串(聯盟)\n(2x狼肋排/1x暴風城特產調料)x25\n配方購於:\n肯多爾卡邦卡:暴風城<74,36>" },
		{ 130, "126-130: 烤獅排(部落)\n(1x獅肉/1x辣椒)x5\n配方購於:\n紮爾夫:貧瘠之地<52,29>\n幹烤狼肉串(聯盟)\n(2x狼肋排/1x暴風城特產調料)x25\n配方購於:\n肯多爾卡邦卡:暴風城<74,36>" },
		{ 175, "131-175: 美味煎蛋捲(聯盟)\n(1x迅猛龍蛋/1x辣椒)x50\n配方購於:\n肯多爾卡邦卡:暴風城<74,36>\n烤獅排(部落)\n(1x獅肉/1x辣椒)x55\n配方購於:\n紮爾夫:貧瘠之地<52,29>" },
		{ 200, "176-200: 烤迅猛龍肉\n(1x迅猛龍肉/1x辣椒)x30\n配方購於:\n耐裏斯特:荊棘谷,格羅姆高營地<32,29>\n布魯斯下士:荊棘谷,反抗軍營地<37,3>" },
		{ 225, "201-225: 蜘蛛肉腸\n(2x白蜘蛛肉)x30\n\n|cFFFFFFFF225接到烹飪大師任務: 迪爾格奎克裏弗:加基森<51,27>給予\n|cFFFFD700需要12個巨蛋/10個美味的蚌肉/20個奧特蘭克冷酪" },
		{ 275, "226-275: 超級煎蛋捲\n(1x巨蛋/2x舒心草)x80\n配方購於:\n琦亞:冬泉谷,永望鎮<61,37>\n西米克:冬泉谷,永望鎮<61,39>\n拜爾:費伍德森林,血毒崗哨<34,53>\n瑪裏甘:費伍德森林,刺枝林地<62,25>\n嫩狼肉排\n(1x嫩狼肉/1x舒心草)x80\n配方購於:\n迪爾格奎克裏弗:塔納利斯,加基森<52,28>\n特魯克蠻鬃:辛特蘭,鷹巢山<14,42>" },
		{ 285, "276-285: 洛恩塔姆薯塊\n(1x洛恩塔姆地薯/1x舒心草)x10\n掉落:普希林 厄運之槌" },
		{ 300, "286-300: 沙漠肉丸子\n(1x沙蟲的肉/1x舒心草)x20\n希利蘇斯任務(旅店老闆)" }
	},	
	-- 來源: http://www.wowguideonline.com/fishing.html
	[BI["Fishing"]] = {
		{ 50, "1-50: 任何起始地點" },
		{ 75, "51-75:\n暴風城的河裏\n奧格瑞瑪的池塘裏" },
		{ 150, "76-150: 希爾斯布萊德丘陵的河裏" },
		{ 225, "151-225: 淒涼之地/阿拉希高地\n150的時候購買<中級釣魚教材 - 鱸魚與你>\n配方購於:\n老人海明威:藏寶海灣<27,77>" },
		{ 250, "226-250: 辛特蘭/塔納利斯\n\n|cFFFFFFFF225開始高級釣魚任務\n起始於各個主城，均到納特帕格:塵泥沼澤<59,61>\n|cFFFFD700野人海岸藍色叉牙魚(荊棘谷<34,35>)\n菲拉斯草魚(沃丹提斯河, 菲拉斯)\n薩瑟裏斯虎魚(薩瑟裏斯海岸北部, 葬影村附近, 淒涼之地)\n蘆葦海岸大馬哈魚(蘆葦海岸, 悲傷沼澤)" },
		{ 260, "251-260: 費伍德森林" },
		{ 300, "261-300: 艾薩拉" }
	},
	
	-- 建議升級地區，來源眾多，不一一列舉了
	["Leveling"] = {
		{ 10, "1-10級: 所有起始地區" },
		{ 20, "11-20級: "  .. BZ["Loch Modan"] .. "\n" .. BZ["Westfall"] .. "\n" .. BZ["Darkshore"] 
						.. "\n" .. BZ["Silverpine Forest"] .. "\n" .. BZ["The Barrens"]},
		{ 25, "21-25級: " .. BZ["Wetlands"] .. "\n" .. BZ["Redridge Mountains"] .. "\n" .. BZ["Ashenvale"] 
						.. "\n" .. BZ["The Barrens"] .. "\n" .. BZ["Stonetalon Mountains"] .. "\n" .. BZ["Hillsbrad Foothills"] },
		{ 28, "26-28級: " .. BZ["Duskwood"] .. "\n" .. BZ["Wetlands"] .. "\n" .. BZ["Ashenvale"] 
						.. "\n" .. BZ["Stonetalon Mountains"] .. "\n" .. BZ["Thousand Needles"] },
		{ 31, "29-31級: " .. BZ["Duskwood"] .. "\n" .. BZ["Thousand Needles"] .. "\n" .. BZ["Ashenvale"] },
		{ 35, "32-35級: " .. BZ["Thousand Needles"] .. "\n" .. BZ["Stranglethorn Vale"] .. "\n" .. BZ["Alterac Mountains"] 
						.. "\n" .. BZ["Arathi Highlands"] .. "\n" .. BZ["Desolace"] },
		{ 40, "36-40級: " .. BZ["Stranglethorn Vale"] .. "\n" .. BZ["Desolace"] .. "\n" .. BZ["Badlands"]
						.. "\n" .. BZ["Dustwallow Marsh"] .. "\n" .. BZ["Swamp of Sorrows"] },
		{ 43, "41-43級: " .. BZ["Tanaris"] .. "\n" .. BZ["Stranglethorn Vale"] .. "\n" .. BZ["Badlands"] 
						.. "\n" .. BZ["Dustwallow Marsh"] .. "\n" .. BZ["Swamp of Sorrows"] },
		{ 45, "44-45級: " .. BZ["Tanaris"] .. "\n" .. BZ["Feralas"] .. "\n" .. BZ["The Hinterlands"] },
		{ 48, "46-48級: " .. BZ["Tanaris"] .. "\n" .. BZ["Feralas"] .. "\n" .. BZ["The Hinterlands"] .. "\n" .. BZ["Searing Gorge"] },
		{ 51, "49-51級: " .. BZ["Tanaris"] .. "\n" .. BZ["Azshara"] .. "\n" .. BZ["Blasted Lands"] 
						.. "\n" .. BZ["Searing Gorge"] .. "\n" .. BZ["Un'Goro Crater"] .. "\n" .. BZ["Felwood"] },
		{ 55, "54-55級: " .. BZ["Un'Goro Crater"] .. "\n" .. BZ["Felwood"] .. "\n" .. BZ["Burning Steppes"]
						.. "\n" .. BZ["Blasted Lands"] .. "\n" .. BZ["Western Plaguelands"] },
		{ 58, "56-58級: " .. BZ["Winterspring"] .. "\n" .. BZ["Burning Steppes"] .. "\n" .. BZ["Western Plaguelands"] 
						.. "\n" .. BZ["Eastern Plaguelands"] .. "\n" .. BZ["Silithus"] },
		{ 60, "59-60級: " .. BZ["Winterspring"] .. "\n" .. BZ["Eastern Plaguelands"] .. "\n" .. BZ["Silithus"] },
	}
}